//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"BUILDING_ENTITY_STORE"="Esecuzione della fase %d di %d: creazione dell'archivio entità";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="Esecuzione della fase %d di %d: creazione del database bootstrap";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="Esecuzione della fase %d di %d: creazione del database coda richieste";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - received bytes; 2nd %s - total bytes.
"DOWNLOADING_ENTITY_STORE"="Esecuzione della fase %d di %d: download dell'archivio entità. Ricezione completata per %s di %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ERASING_EXPIRED_REQUESTS"="Esecuzione della fase %d di %d: eliminazione delle richieste scadute";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"LOADING_METADATA"="Esecuzione della fase %d di %d: caricamento dei metadati";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="Esecuzione della fase %d di %d: esecuzione della fusione coda richieste";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="Esecuzione della fase %d di %d: esecuzione della fusione transazioni";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="Esecuzione della fase %d di %d: esecuzione creazione eliminazione fusione";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request name; 2nd %s - request url.
"PROCESSING_DEFINING_QUERIES"="Esecuzione della fase %d di %d: elaborazione definizione query %s con %s";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request number; 2nd %s - total request number.
"PROCESSING_REQUESTS"="Esecuzione della fase %d di %d: elaborazione delle richieste. Invio richiesta di modifica %s di %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REAPPLYING_CHANGES"="Esecuzione della fase %d di %d: riapplicazione delle modifiche";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ANALYZING_RECEIVED_DATA"="Esecuzione della fase %d di %d: analisi dei dati ricevuti";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - received bytes.
"RECEIVING_DATA_FROM_SERVER"="Esecuzione della fase %d di %d: ricezione di dati dal server. Ricezione completata per %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="Esecuzione della fase %d di %d: rimozione delle relazioni eliminate";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="Esecuzione della fase %d di %d: rimozione delle richieste specificate come RemoveAfterUpload";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - sent bytes.
"SENDING_DATA_TO_SERVER"="Esecuzione della fase %d di %d: invio di dati al server. Invio completato per %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="Esecuzione della fase %d di %d: invio del database archivio entità. Invio completato per %s di %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="Esecuzione della fase %d di %d: invio del database coda richieste. Invio completato per %s di %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="Esecuzione della fase %d di %d: avvio della comunicazione con il server";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"UPLOAD_PREPROCESSING"="Esecuzione della fase %d di %d: preelaborazione delle richieste prima del caricamento";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"WAITING_FOR_DOWNLOAD"="Esecuzione della fase %d di %d: in attesa di download";

